"common.ok" = "ОК";
"common.cancel" = "Отмена";
"common.save" = "Сохранить";
"common.done" = "Готово";
"common.na" = "н/д";
"common.all" = "Все";
"app.language" = "app.language";

"language.section" = "Язык";
"language.system" = "Системный";
"language.english" = "Английский";
"language.russian" = "Русский";

"panel.title" = "Симулятор цифрового двойника БПЛА";
"panel.keyboard_hint" = "WASD/QE полет, Shift ускорение, 1..6 камеры, M карта, / компас, стрелки только FPV, +/- зум";
"panel.workflow_hint" = "Основные команды находятся в верхней ленте. Показывайте и скрывайте параметры кнопками панели.";
"panel.toggle_collapse" = "Свернуть/развернуть панель";
"panel.collapse" = "Свернуть панель";
"panel.expand" = "Развернуть панель";
"panel.parameters.on" = "Параметры: Вкл";
"panel.parameters.off" = "Параметры: Выкл";
"panel.hide" = "Скрыть панель параметров";
"panel.show" = "Показать панель параметров";
"panel.drone_profile" = "Профиль БПЛА";
"panel.model" = "Модель";
"panel.mass" = "Масса";
"panel.max_flight" = "Макс. время полета";
"panel.max_wind" = "Сопротивление ветру";
"panel.camera_layout" = "Компоновка камер";
"panel.visual_class" = "Визуальный класс";
"panel.commands" = "Команды";
"panel.position" = "Положение";
"panel.orientation" = "Ориентация";
"panel.throttle" = "Тяга";
"panel.camera" = "Камера";
"panel.camera_mode" = "Режим камеры";
"panel.weather" = "Погода";
"panel.terrain" = "Местность";
"panel.diagnostics" = "Диагностика";
"panel.fleet" = "Группа";
"panel.damage" = "Повреждения и состояние";
"panel.warnings" = "Предупреждения";
"panel.telemetry" = "Телеметрия";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Крен";
"axis.pitch" = "Тангаж";
"axis.yaw" = "Рыскание";

"camera.mode.free" = "Свободная";
"camera.mode.follow" = "Вид от хвоста";
"camera.mode.third_person" = "Вид сзади";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Орбита";
"camera.mode.top" = "Вид сверху";
"camera.mode.payload" = "Сброс ПН";
"camera.mode.top_down" = "Вид сверху";
"camera.payload.auto_switch" = "Автопереход на камеру ПН после сброса";
"camera.fov" = "Угол обзора";
"camera.sensitivity" = "Чувствительность";
"camera.smoothing" = "Сглаживание";
"camera.orbit_distance" = "Дистанция орбиты";
"camera.follow_x" = "Смещение следования X";
"camera.follow_y" = "Смещение следования Y";
"camera.follow_z" = "Смещение следования Z";
"camera.fpv_stabilization" = "FPV стабилизация";
"camera.fpv_shake" = "FPV дрожание";

"command.reset" = "Сброс";
"command.takeoff" = "Взлет";
"command.land" = "Посадка";
"command.hover" = "Зависнуть";
"command.auto_path" = "Авто-маршрут";
"command.return_home" = "Возврат домой";
"command.emergency_stop" = "Аварийная остановка";
"command.start_animation" = "Запустить симуляцию";
"command.stop_animation" = "Остановить симуляцию";

"weather.normal" = "Обычная";
"weather.wind" = "Ветер";
"weather.rain" = "Дождь";
"weather.snow" = "Снег";
"weather.fog" = "Туман";
"weather.smog" = "Смог";
"weather.thunderstorm" = "Гроза";
"weather.intensity" = "Интенсивность";
"weather.wind_direction" = "Направление ветра";
"weather.wind_speed" = "Скорость ветра";
"weather.gusts" = "Порывы";

"terrain.grid_demo" = "Сетка (демо)";
"terrain.field" = "Поле";
"terrain.forest" = "Лес";
"terrain.cargo_yard" = "Грузовой двор";
"terrain.city" = "Город";
"terrain.density" = "Плотность объектов";
"terrain.seed" = "Сид генератора";
"terrain.scale" = "Масштаб карты";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"terrain.scale.64x64" = "64x64";
"terrain.scale.128x128" = "128x128";
"terrain.scale.256x256" = "256x256";
"terrain.scale.512x512" = "512x512";
"environment.boundary_barrier_visible" = "Показывать граничный барьер";

"diagnostic.mode" = "Режим диагностики";
"diagnostic.mode.normal" = "Обычный вид";
"diagnostic.mode.thermal" = "Тепло / Нагрузка";
"diagnostic.mode.damage" = "Повреждения / Целостность";
"diagnostic.collision_debug" = "Отладка коллизий";
"diagnostic.toggle_thermal" = "Тепловой слой";
"diagnostic.toggle_damage" = "Слой повреждений";
"diagnostic.fleet_mode" = "Включить группу";

"fleet.formation" = "Построение";
"fleet.mode.off" = "Выкл";
"fleet.mode.line" = "Линия";
"fleet.mode.triangle" = "Треугольник";
"fleet.separation" = "Интервал";
"fleet.wingmen" = "Ведомые";
"fleet.risk" = "Риск между дронами";
"fleet.nearest" = "Минимальная дистанция";

"damage.reset" = "Сбросить повреждения";
"damage.clear_selection" = "Снять выбор";
"damage.hide" = "Скрыть";

"component.battery" = "Батарея";
"component.gimbal" = "Передняя камера / подвес";
"component.fc_core" = "Ядро полетного контроллера";
"component.motor_fl" = "Мотор FL";
"component.motor_fr" = "Мотор FR";
"component.motor_rl" = "Мотор RL";
"component.motor_rr" = "Мотор RR";
"component.propeller_fl" = "Пропеллер FL";
"component.propeller_fr" = "Пропеллер FR";
"component.propeller_rl" = "Пропеллер RL";
"component.propeller_rr" = "Пропеллер RR";
"component.arm_fl" = "Луч FL";
"component.arm_fr" = "Луч FR";
"component.arm_rl" = "Луч RL";
"component.arm_rr" = "Луч RR";
"component.esc_power" = "ESC / силовая электроника";

"warning.nominal" = "Норма";
"warning.warning" = "Внимание";
"warning.critical" = "Критично";
"warning.collision_high" = "Высокий риск столкновения";
"warning.weather_severe" = "Сложные погодные условия";
"warning.battery_low" = "Низкий заряд батареи";
"warning.integrity_low" = "Низкая структурная целостность";
"warning.fixedwing_low_speed" = "Низкая скорость самолётного БПЛА / риск сваливания";
"warning.fleet_risk" = "Риск в построении группы";
"warning.interdrone_critical" = "Критическое сближение дронов";
"warning.emergency" = "Активирован аварийный режим";
"warnings.none" = "Активных предупреждений нет";
"summary.damage.none" = "Критичных повреждений нет";

"signal_loss.warning" = "Сигнал будет утерян через %d...";
"signal_loss.lost_title" = "Сигнал потерян";
"signal_loss.lost_message" = "Аппарат вышел за пределы карты. Управление заблокировано до восстановления сигнала.";
"signal_loss.recover" = "Восстановить сигнал";

"telemetry.position" = "Координаты";
"telemetry.velocity" = "Скорость (вектор)";
"telemetry.attitude" = "Ориентация";
"telemetry.speed" = "Скорость";
"telemetry.throttle" = "Тяга";
"telemetry.mode" = "Режим";
"telemetry.state" = "Состояние";
"telemetry.battery" = "Батарея";
"telemetry.power" = "Потребление";
"telemetry.remaining" = "Осталось";
"telemetry.weather" = "Погода";
"telemetry.collision_risk" = "Риск столкновения";
"telemetry.nearest_obstacle" = "Ближайшее препятствие";
"telemetry.emergency" = "Аварийное действие";
"telemetry.mission_status" = "Статус миссии";
"telemetry.damage" = "Повреждения";
"telemetry.thermal" = "Тепловая сводка";
"telemetry.fleet" = "Режим группы";
"telemetry.fleet_risk" = "Риск группы";
"telemetry.nearest_interdrone" = "До ближайшего дрона";
"telemetry.export" = "Экспорт телеметрии";
"telemetry.export.success" = "Телеметрия экспортирована";
"telemetry.export.failure" = "Ошибка экспорта телеметрии";

"mission.map.open_help" = "Карта миссии";
"mission.map.title" = "ТАКТИЧЕСКАЯ КАРТА";
"mission.map.subtitle" = "Полноэкранная поверхность задания типа миссии, ограничений, preview маршрута и предмиссионной проверки";
"mission.map.exit" = "ВЫЙТИ ИЗ КАРТЫ";
"mission.map.clear_route" = "ОЧИСТИТЬ МАРШРУТ";
"mission.map.clear_drop_zone" = "ОЧИСТИТЬ ЗОНУ СБРОСА";
"mission.map.clear_context" = "ОЧИСТИТЬ КОНТЕКСТ";
"mission.map.delete_last" = "УДАЛИТЬ ПОСЛ.";
"mission.map.clear_draft" = "ОЧИСТИТЬ ЧЕРНОВИК";
"mission.map.rebuild_preview" = "ПЕРЕСЧИТАТЬ";
"mission.map.rebuild_plan" = "ПЕРЕСОБРАТЬ ПЛАН";
"mission.map.cancel" = "ОТМЕНИТЬ";
"mission.map.confirm" = "ПРИМЕНИТЬ ЧЕРНОВИК";
"mission.map.instruction.view" = "Просмотрите границы, препятствия, черновой маршрут и зоны. В этом режиме клики по карте не изменяют план.";
"mission.map.instruction.route" = "Кликните по карте, чтобы поставить operational waypoint.";
"mission.map.instruction.drop_zone_center" = "Кликните по карте, чтобы задать центр зоны сброса.";
"mission.map.instruction.drop_zone_radius" = "Настройте радиус зоны сброса и пересчитайте или примените черновик.";
"mission.map.instruction.zone_center" = "Кликните по карте, чтобы поставить круглую no-fly зону.";
"mission.map.instruction.return_point" = "Кликните по карте, чтобы задать точку назначенного возврата.";
"mission.map.summary.format" = "БЛА %+.1f / %+.1f   БАЗА %+.1f / %+.1f   КАРТА %.0f м";
"mission.map.route.metrics.format" = "ТЧК %d | ДЛН %.0f м | СЕГ %d | РИСК %d";
"mission.map.route.validation.format" = "ETA %.0f с | СЛЖ %.0f%% | ПРП %.0f%%";
"mission.map.route.value.format" = "ТЧК %d | ДЛН %.0f м | СЕГ %d";
"mission.map.zones.value.format" = "ЗОН %d | РИСК %d";
"mission.map.drop_zone.value.format" = "ЦЕНТР %+.1f / %+.1f   R %.1f м";
"mission.map.section.plan" = "ПЛАН МИССИИ";
"mission.map.section.plan.subtitle" = "Тип миссии, политика возврата и активный режим постановки";
"mission.map.section.constraints" = "ОГРАНИЧЕНИЯ";
"mission.map.section.constraints.subtitle" = "Высота, скорость и резерв до старта";
"mission.map.section.route" = "МАРШРУТ";
"mission.map.section.route.subtitle" = "Вывод planner, валидность preview и текущие метрики маршрута";
"mission.map.section.energy" = "ЭНЕРГИЯ";
"mission.map.section.energy.subtitle" = "Прогноз расхода, запас и совместимость полезной нагрузки";
"mission.map.section.drop_zone" = "ЗОНА СБРОСА";
"mission.map.section.zones" = "МИССИОННЫЕ ЗОНЫ";
"mission.map.section.zone_radius" = "РАДИУС ЗОНЫ";
"mission.map.section.validation" = "ВАЛИДАЦИЯ";
"mission.map.section.validation.subtitle" = "Блокировки запуска и marginal-состояния, найденные preflight-проверкой";
"mission.map.section.preview_checks" = "ПРОВЕРКИ PREVIEW";
"mission.map.section.preview_checks.subtitle" = "Блокировки planner и предупреждения по маршруту";
"mission.map.section.workflow" = "РЕЖИМЫ РАБОТЫ";
"mission.map.section.workflow.subtitle" = "Инструменты этапа 1 для постановки точек и зон";
"mission.map.section.feasibility" = "ВЫПОЛНИМОСТЬ";
"mission.map.section.feasibility.subtitle" = "Совместимость ПН, энергетический резерв и экспозиция planner";
"mission.map.section.payload_delivery" = "ДОСТАВКА ПОЛЕЗНОЙ НАГРУЗКИ";
"mission.map.section.payload_delivery.subtitle" = "Автосброс и готовность подвешенной нагрузки";
"mission.map.section.events" = "СОБЫТИЯ";
"mission.map.section.events.subtitle" = "Последние записи миссионного журнала";
"mission.map.zone_radius.value" = "%.1f м";
"mission.map.energy.summary.format" = "РАСХ %.0f%% | ОСТ %.0f%% | РЕЗ %.0f%% | ЗАП %.0f%%";
"mission.map.feasibility.energy.format" = "РАСХ %.0f%% | ОСТ %.0f%% | РЕЗ %.0f%%";
"mission.map.auto_release" = "Автосброс над центром зоны";
"mission.map.payload_ready" = "Подвешенная полезная нагрузка готова к доставке";
"mission.map.payload_unavailable" = "Для миссии доставки требуется прикрепленная полезная нагрузка";
"mission.map.events.empty" = "Событий миссии пока нет.";
"mission.map.active_drop_zone" = "ЗОНА ЕСТЬ";
"mission.map.no_drop_zone" = "ЗОНЫ НЕТ";
"mission.map.active_route" = "МАРШРУТ ЕСТЬ";
"mission.map.no_route" = "МАРШРУТА НЕТ";
"mission.map.footer_hint" = "Примените черновик, чтобы зафиксировать preflight-план и синхронизировать operational overlays со сценой.";
"mission.map.no_route_target" = "Маршрут не задан";
"mission.map.no_drop_zone_value" = "Зона сброса не задана";
"mission.map.mission_type" = "Тип миссии";
"mission.map.return_mode" = "Режим возврата";
"mission.map.zone_type" = "Тип зоны";
"mission.map.constraint.return_home" = "Требовать резерв на возврат домой";
"mission.map.constraint.max_altitude" = "Макс. высота";
"mission.map.constraint.min_altitude" = "Мин. высота";
"mission.map.constraint.max_speed" = "Макс. скорость";
"mission.map.constraint.reserve" = "Политика резерва";
"mission.map.constraint.altitude.value" = "%.1f м";
"mission.map.constraint.speed.value" = "%.1f м/с";
"mission.map.constraint.reserve.value" = "%.0f %%";
"mission.map.status.draft_dirty" = "ЧЕРНОВИК ИЗМЕНЕН";
"mission.map.status.plan_synced" = "ПЛАН СИНХР.";

"mission.mode.navigation" = "МАРШРУТ";
"mission.mode.view" = "ОБЗОР";
"mission.mode.waypoint" = "ТЧК";
"mission.mode.drop_zone" = "СБРОС";
"mission.mode.zone" = "NO-FLY";
"mission.mode.return_point" = "ВОЗВРАТ";

"mission.type.recon" = "Разведка";
"mission.type.delivery" = "Доставка";
"mission.type.observation" = "Наблюдение";
"mission.type.relay" = "Ретрансляция";
"mission.type.free_route" = "Свободный маршрут";

"mission.phase.preflight" = "PREFLIGHT";
"mission.phase.ready" = "READY";
"mission.phase.takeoff" = "TAKEOFF";
"mission.phase.transit" = "TRANSIT";
"mission.phase.approach" = "APPROACH";
"mission.phase.payload_delivery" = "PAYLOAD";
"mission.phase.return_home" = "RETURN";
"mission.phase.landing" = "LANDING";
"mission.phase.paused" = "PAUSED";
"mission.phase.completed" = "COMPLETED";
"mission.phase.aborted" = "ABORTED";

"mission.execution.status.idle" = "EXEC IDLE";
"mission.execution.status.ready" = "EXEC READY";
"mission.execution.status.running" = "EXEC RUN";
"mission.execution.status.paused" = "EXEC PAUSE";
"mission.execution.status.completed" = "EXEC DONE";
"mission.execution.status.aborted" = "EXEC ABORT";
"mission.execution.status.failedsafe" = "FAILSAFE";

"mission.command.prepare" = "Подготовить миссию";
"mission.command.arm_for_mission" = "Arm for mission";
"mission.command.start" = "Запустить миссию";
"mission.command.pause" = "Пауза миссии";
"mission.command.resume" = "Продолжить миссию";
"mission.command.abort" = "Прервать миссию";
"mission.command.return_home" = "Возврат домой";
"mission.command.hold" = "Удержание";
"mission.command.trigger_payload" = "Выполнить сброс";

"mission.abort.user" = "Миссия прервана оператором.";
"mission.abort.invalid_plan" = "Исполнимый план миссии потерян или больше невалиден.";
"mission.abort.low_battery" = "Миссия остановлена из-за низкого батарейного резерва.";
"mission.abort.route_unavailable" = "Маршрут миссии больше недоступен.";
"mission.abort.payload_failure" = "Операция полезной нагрузки завершилась ошибкой.";
"mission.abort.boundary_violation" = "Миссия вышла за пределы рабочей области.";
"mission.abort.failsafe_triggered" = "Миссия прервана из-за срабатывания failsafe.";

"mission.failsafe.hold" = "FAILSAFE HOLD";
"mission.failsafe.return_home" = "FAILSAFE RTL";
"mission.failsafe.forced_landing" = "FAILSAFE LAND";
"mission.failsafe.abort" = "FAILSAFE ABORT";

"mission.return.return_home" = "Возврат домой";
"mission.return.hold" = "Удержание";
"mission.return.land_designated" = "Посадка в точке";

"mission.zone.drop" = "Зона сброса";
"mission.zone.no_fly" = "Запретная зона";
"mission.zone.caution" = "Зона внимания";
"mission.zone.landing" = "Посадочная зона";
"mission.zone.observation" = "Зона наблюдения";
"mission.zone.signal_risk" = "Зона риска связи";

"mission.feasibility.safe" = "SAFE";
"mission.feasibility.marginal" = "MARGINAL";
"mission.feasibility.unsafe" = "UNSAFE";

"mission.link.nominal" = "LINK NOMINAL";
"mission.link.degraded" = "LINK DEGRADED";
"mission.link.critical" = "LINK CRITICAL";
"mission.link.lost" = "LINK LOST";

"mission.status.map_active" = "КАРТА МИССИИ АКТИВНА";
"mission.status.route_ready" = "МАРШРУТ ГОТОВ";
"mission.status.drop_zone_set" = "ЗОНА СБРОСА ЗАДАНА";
"mission.status.delivery_ready" = "ДОСТАВКА ГОТОВА";
"mission.status.in_drop_zone" = "БЛА В ЗОНЕ СБРОСА";
"mission.status.payload_released" = "ПОЛЕЗНАЯ НАГРУЗКА СБРОШЕНА";

"mission.preview.status.idle" = "PREVIEW IDLE";
"mission.preview.status.valid" = "PREVIEW VALID";
"mission.preview.status.blocked" = "PREVIEW BLOCKED";
"mission.preview.message.empty" = "Добавьте waypoint или зону сброса, чтобы получить первый preview маршрута.";
"mission.preview.message.awaiting_rebuild" = "Геометрия черновика изменилась. Пересчитайте или примените его, чтобы обновить вывод planner.";
"mission.preview.message.valid" = "Planner вернул валидный preview маршрута для текущей рабочей области.";
"mission.preview.blocked.no_free_start_or_goal" = "Planner не смог найти свободную стартовую или целевую ячейку внутри текущего obstacle-поля.";
"mission.preview.blocked.astar" = "Planner не смог связать маршрут: path blocked препятствиями или no-fly геометрией.";
"mission.preview.blocked.grid" = "Planner grid не удалось подготовить для текущего terrain/obstacle контекста.";
"mission.preview.blocked.generic" = "Preview маршрута заблокирован. Измените точки, зоны или масштаб карты и пересчитайте его.";
"mission.plan.status.ready" = "ГОТОВ";
"mission.plan.status.marginal" = "MARGINAL";
"mission.plan.status.blocked" = "ЗАБЛОКИРОВАН";
"mission.validation.severity.info" = "INFO";
"mission.validation.severity.warning" = "WARNING";
"mission.validation.severity.error" = "ERROR";
"mission.validation.home_missing" = "Домашняя точка миссии недоступна или задана некорректно.";
"mission.validation.waypoint_sequence" = "Шаг между waypoint слишком мал для устойчивого preview маршрута.";
"mission.validation.zone_invalid" = "Одна или несколько миссионных зон имеют некорректную геометрию.";
"mission.validation.altitude_window" = "Ограничения по высоте противоречат друг другу.";
"mission.validation.speed_limit" = "Заданная крейсерская скорость превышает возможности активного аппарата.";
"mission.validation.route_conflict" = "Проверенный маршрут конфликтует с активной no-fly геометрией.";
"mission.validation.return_reserve" = "Прогнозный батарейный запас недостаточен для требуемой политики возврата.";

"mission.validation.no_route" = "Маршрут миссии не задан.";
"mission.validation.delivery_requires_drop_zone" = "Миссии доставки требуется настроенная зона сброса.";
"mission.validation.payload_incompatible" = "Связка БЛА и полезной нагрузки несовместима.";
"mission.validation.delivery_requires_payload" = "Миссии доставки требуется прикрепленная полезная нагрузка.";
"mission.validation.energy_marginal" = "Прогнозный энергетический резерв находится в marginal-зоне.";
"mission.validation.energy_unsafe" = "Прогнозный энергетический резерв unsafe для запуска.";
"mission.validation.risk_zone_intersections" = "Маршрут пересекает зоны риска.";
"mission.validation.weather_penalty" = "Погодные условия снижают выполнимость миссии.";
"mission.payload.summary.none" = "Активная конфигурация полезной нагрузки отсутствует.";
"mission.payload.summary.ready" = "Конфигурация полезной нагрузки совместима с выбранным планом миссии.";
"mission.payload.summary.incompatible" = "Текущая конфигурация полезной нагрузки несовместима с активной платформой.";
"mission.payload.summary.delivery_missing" = "Для миссии доставки требуется прикрепленная полезная нагрузка.";

"mission.warning.link_lost" = "Связь миссии потеряна. Нужен RTL или иной failsafe.";
"mission.warning.link_critical" = "Качество связи миссии критическое.";
"mission.warning.energy_low" = "Энергетический резерв низкий. Возврат рекомендован.";
"mission.warning.energy_critical" = "Энергетический резерв критический. Возможна принудительная посадка.";
"mission.warning.invalid_plan_runtime" = "Исполнение миссии невозможно без валидированного исполнимого плана.";
"mission.warning.route_unavailable" = "Маршрут миссии недоступен. Требуется удержание или возврат.";
"mission.warning.boundary_violation" = "Миссия вышла за рабочую границу. Запрошен возврат домой.";
"mission.warning.payload_not_allowed" = "Сброс полезной нагрузки недоступен в текущей фазе миссии.";

"mission.event.severity.info" = "Info";
"mission.event.severity.warning" = "Warning";
"mission.event.severity.critical" = "Critical";
"mission.event.arm" = "Аппарат вооружен.";
"mission.event.disarm" = "Аппарат разоружен.";
"mission.event.disarm_emergency" = "Выполнено аварийное разоружение.";
"mission.event.takeoff" = "Инициирован взлет миссии.";
"mission.event.landing" = "Инициирована посадка.";
"mission.event.started" = "Исполнение миссии начато.";
"mission.event.aborted" = "Миссия прервана.";
"mission.event.completed" = "Миссия завершена.";
"mission.event.plan_confirmed" = "План миссии подтвержден.";
"mission.event.prepared" = "Состояние исполнения миссии подготовлено.";
"mission.event.replan" = "Маршрут миссии перестроен.";
"mission.event.rtl" = "Активирован возврат домой.";
"mission.event.execution_status_changed" = "Статус исполнения миссии изменен.";
"mission.event.failsafe" = "Активировано failsafe-действие миссии.";
"mission.event.emergency_stop" = "Включена аварийная остановка.";
"mission.event.payload_attached" = "Полезная нагрузка прикреплена.";
"mission.event.payload_removed" = "Полезная нагрузка снята.";
"mission.event.payload_released" = "Полезная нагрузка сброшена.";
"mission.event.payload_lifecycle" = "Состояние полезной нагрузки обновлено.";
"mission.event.phase_changed" = "Фаза миссии изменена.";
"mission.event.link_state_changed" = "Состояние связи изменено.";
"mission.event.link_lost" = "Связь миссии потеряна.";
"mission.event.energy_low" = "Энергетический резерв миссии стал низким.";
"mission.event.energy_critical" = "Энергия миссии стала критической.";
"mission.event.thermal_warning" = "Тепловое состояние вошло в предупреждающий диапазон.";
"mission.event.thermal_critical" = "Тепловое состояние достигло критического порога.";
"mission.event.zone_enter" = "Вход в миссионную зону.";
"mission.event.zone_exit" = "Выход из миссионной зоны.";
"mission.event.waypoint_reached" = "Точка маршрута достигнута.";
"mission.event.debrief_generated" = "Сформирован debrief миссии.";
"mission.event.operator_command" = "Получена операторская команда миссии.";
"mission.event.category.execution" = "Исполнение";
"mission.event.category.navigation" = "Навигация";
"mission.event.category.payload" = "Полезная нагрузка";
"mission.event.category.battery" = "Энергия";
"mission.event.category.thermal" = "Тепло";
"mission.event.category.safety" = "Безопасность";
"mission.event.category.diagnostics" = "Диагностика";
"mission.event.category.operator" = "Оператор";
"mission.event.category.system" = "Система";
"mission.outcome.success" = "Успех";
"mission.outcome.partial" = "Частичный успех";
"mission.outcome.aborted" = "Прервано";
"mission.outcome.failed" = "Провал";
"mission.outcome.failsafe_return" = "Failsafe-возврат";
"mission.outcome.failsafe_landing" = "Failsafe-посадка";
"mission.debrief.verdict.success" = "Цели миссии достигнуты в штатных пределах.";
"mission.debrief.verdict.partial" = "Миссия завершена с деградацией результата или активными предупреждениями.";
"mission.debrief.verdict.aborted" = "Миссия остановлена оператором или управляющей логикой.";
"mission.debrief.verdict.failed" = "Миссия не достигла плановой цели.";
"mission.debrief.verdict.failsafe_return" = "Миссия завершилась контролируемым failsafe-возвратом.";
"mission.debrief.verdict.failsafe_landing" = "Миссия завершилась принудительной failsafe-посадкой.";

"mission.debrief.success" = "УСПЕХ";
"mission.debrief.failure" = "НЕУСПЕХ";
"mission.debrief.payload.not_started" = "Задача по ПН не запускалась";
"mission.debrief.payload.pending" = "Задача по ПН не завершена";
"mission.debrief.payload.completed" = "Задача по ПН выполнена";

"module.mission.title" = "Миссия";
"module.mission.toolbar_title" = "Миссия";
"module.mission.subtitle" = "Слой планирования и валидации миссии поверх tactical map";
"module.mission.status" = "СТАТУС МИССИИ";
"module.mission.status.subtitle" = "Зафиксированный план миссии, статус planner и текущий масштаб карты";
"module.mission.command_stack" = "КОМАНДНЫЙ СТЕК";
"module.mission.command_stack.subtitle" = "Вход в tactical map, пересборка валидации или очистка сохраненного planning state";
"module.mission.open_map" = "Открыть карту";
"module.mission.validate_plan" = "Проверить план";
"module.mission.start" = "Запустить миссию";
"module.mission.abort" = "Прервать миссию";
"module.mission.clear_plan" = "Очистить план";
"module.mission.energy" = "ЭНЕРГОПРОГНОЗ";
"module.mission.energy.subtitle" = "Предмиссионный расход, резерв и влияние полезной нагрузки";
"module.mission.preview_checks" = "ПРОВЕРКИ PREVIEW";
"module.mission.preview_checks.subtitle" = "Ошибки валидации и маршрутные блокировки до запуска";
"module.mission.warnings" = "ПРЕДУПРЕЖДЕНИЯ МИССИИ";
"module.mission.warnings.subtitle" = "Энергия, связь и ошибки валидации";
"module.mission.warnings.none" = "Активных ошибок валидации нет.";
"module.mission.event_log" = "ЖУРНАЛ СОБЫТИЙ";
"module.mission.event_log.subtitle" = "Структурированный журнал миссии";
"module.mission.events.none" = "События миссии отсутствуют.";
"module.mission.events.clear_view" = "Очистить вид";
"module.mission.events.show_all" = "Показать все";
"module.mission.debrief" = "POST-FLIGHT DEBRIEF";
"module.mission.debrief.subtitle" = "Результат миссии и инженерная сводка";
"module.mission.metric.type" = "Тип";
"module.mission.metric.scale" = "Масштаб";
"module.mission.metric.status" = "Статус";
"module.mission.metric.phase" = "Фаза";
"module.mission.metric.link" = "Связь";
"module.mission.metric.distance" = "Дистанция";
"module.mission.metric.current_waypoint" = "Текущая точка";
"module.mission.metric.remaining" = "Остаток";
"module.mission.metric.reserve" = "Резерв";
"module.mission.metric.energy_use" = "Расход";
"module.mission.metric.energy_remaining" = "Остаток";
"module.mission.metric.flight_time" = "ETA";
"module.mission.metric.eta" = "ETA";
"module.mission.metric.payload" = "ПН";
"module.mission.metric.waypoints" = "Точки";
"module.mission.metric.zones" = "Зоны";
"module.mission.preview.empty" = "Сохраненного preview маршрута пока нет. Откройте карту и примените черновой маршрут.";
"module.mission.debrief.result" = "Итог";
"module.mission.debrief.duration" = "Длительность";
"module.mission.debrief.distance" = "Дистанция";
"module.mission.debrief.energy" = "Энергия";

"module.diagnostics.mission_status" = "СТАТУС МИССИИ";
"module.diagnostics.mission_status.subtitle" = "Фаза миссии, связь и контур предупреждений";
"module.diagnostics.mission_events" = "СОБЫТИЯ МИССИИ";
"module.diagnostics.mission_events.subtitle" = "Последние записи операционного журнала";
"module.diagnostics.mission_debrief" = "DEBRIEF МИССИИ";
"module.diagnostics.mission_debrief.subtitle" = "Итоговая постполетная сводка";

"hud.title" = "HUD телеметрии";
"hud.telemetry" = "Телеметрия";
"hud.camera" = "Камера";
"hud.drone" = "Дрон";

"mode.manual" = "Ручной";
"mode.auto_path" = "Авто-маршрут";
"mode.return_home" = "Возврат домой";
"mode.hover" = "Зависание";
"mode.emergency_stop" = "Аварийная остановка";
"mode.takeoff" = "Взлет";
"mode.landing" = "Посадка";

"flight_state.on_ground" = "На земле";
"flight_state.battery_depleted" = "Батарея разряжена";
"flight_state.ascending" = "Набор высоты";
"flight_state.descending" = "Снижение";
"flight_state.emergency" = "Авария";
"flight_state.stable" = "Стабильно";
"flight_state.climbing" = "Подъем";
"flight_state.cruise" = "Крейсерский";

"emergency.none" = "Нет";
"emergency.slow_down" = "Снизить скорость";
"emergency.hover" = "Зависнуть";
"emergency.avoid" = "Обход";
"emergency.stop" = "Аварийная остановка";

"battery.depleted.title" = "Батарея разряжена";
"battery.depleted.message" = "Заряд полностью исчерпан. Выберите действие для продолжения.";
"battery.depleted.charge" = "Зарядить дрон";
"battery.depleted.restart" = "Перезапустить сценарий";

"abstract.edit" = "Редактировать параметры";
"abstract.editor.title" = "Параметры абстрактного БЛА";
"abstract.editor.mass" = "Масса";
"abstract.editor.dimensions" = "Габариты";
"abstract.editor.energy" = "Энергия и ограничения";
"abstract.editor.control" = "Управляемость";
"abstract.validation.vertical" = "Скорость набора/снижения слишком мала.";
"abstract.validation.speed" = "Горизонтальная скорость должна быть >= вертикальных.";
"abstract.validation.radius" = "Радиус коллизии слишком велик для выбранных габаритов.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Абстрактный БЛА";

"drone.visual.mini" = "Легкий компактный квадрокоптер";
"drone.visual.vector" = "Средний квадрокоптер с двумя камерами";
"drone.visual.atlas" = "Крупный профессиональный квадрокоптер";
"drone.visual.abstract" = "Пользовательский абстрактный профиль";

"drone.camera.single_compact" = "Один компактный фронтальный подвес";
"drone.camera.dual_front" = "Двойной фронтальный камерный модуль";
"drone.camera.triple_front" = "Тройной фронтальный камерный модуль";
"drone.camera.custom" = "Пользовательский редактируемый модуль";

"ui.toggle_telemetry_hud" = "Переключить компактный HUD телеметрии";

"camera.zoom_sensitivity" = "Чувствительность зума";
"camera.free_speed" = "Скорость свободной камеры";
"camera.distance" = "Дистанция камеры";
"camera.fpv_yaw_limit" = "Лимит FPV рыскания";
"camera.fpv_pitch_limit" = "Лимит FPV тангажа";
"camera.fpv_near_clip" = "FPV ближняя отсечка";
"camera.fpv_mount_x" = "FPV крепление X";
"camera.fpv_mount_y" = "FPV крепление Y";
"camera.fpv_mount_z" = "FPV крепление Z";
"camera.fpv_hide_obstructing" = "Скрывать мешающие части дрона в FPV";

"keybind.section.title" = "Назначения клавиш";
"keybind.open" = "Горячие клавиши";
"keybind.category.flight" = "Управление полетом";
"keybind.category.camera" = "Управление камерой";
"keybind.category.ui" = "Управление интерфейсом";
"keybind.category.debug" = "Отладка / наложения";
"keybind.flight.forward" = "Вперед";
"keybind.flight.backward" = "Назад";
"keybind.flight.left" = "Влево";
"keybind.flight.right" = "Вправо";
"keybind.flight.descend" = "Снижение";
"keybind.flight.ascend" = "Набор высоты";
"keybind.flight.yaw_left" = "Рыскание влево";
"keybind.flight.yaw_right" = "Рыскание вправо";
"keybind.flight.accelerate" = "Ускорение";
"keybind.flight.hover" = "Зависание / стабилизация";
"keybind.flight.reset" = "Сброс дрона";
"keybind.camera.mode1" = "Камера 1 (Свободная)";
"payload.select" = "Полезная нагрузка";
"payload.configure" = "Настройка ПН";
"payload.toolbar.open" = "Открыть модуль полезной нагрузки";
"payload.toolbar.close" = "Закрыть модуль полезной нагрузки";
"payload.section" = "НАСТРОЙКА ПН";
"payload.console.subtitle" = "Операционный модуль полезной нагрузки для активного профиля БЛА";
"payload.type" = "Тип ПН";
"payload.data_source" = "Источник данных ПН";
"payload.data.verified" = "ПРОВЕРЕНО";
"payload.data.estimated" = "ОЦЕНОЧНО";
"payload.data.custom" = "ВРУЧНУЮ";
"payload.data.estimated_hint" = "Часть ограничений рассчитана по консервативным оценочным данным модели.";
"payload.mass" = "Масса ПН";
"payload.custom_name" = "Название";
"payload.status" = "Статус ПН";
"payload.mount.title" = "Крепление";
"payload.mount.unavailable" = "НЕДОСТУПНО";
"payload.mount.ready" = "ГОТОВО";
"payload.mount.occupied" = "ЗАНЯТО";
"payload.limits.title" = "Ограничения БЛА";
"payload.base_mass" = "Масса БЛА";
"payload.battery_mass" = "Масса батареи";
"payload.max_payload" = "Лимит ПН";
"payload.max_takeoff" = "Макс. взлетная масса";
"payload.total_mass" = "Итоговая масса";
"payload.attach" = "Установить";
"payload.release" = "Сбросить";
"payload.remove" = "Снять";
"payload.mass_value" = "%.2f кг";
"payload.state.no_payload" = "НЕТ ПН";
"payload.state.attached" = "УСТАНОВЛЕНА";
"payload.state.removed" = "СНЯТА";
"payload.state.released" = "СБРОШЕНА";
"payload.state.falling" = "ПАДАЕТ";
"payload.state.landed" = "ПРИЗЕМЛЕНА";
"payload.state.cleaned_up" = "УБРАНА";
"payload.message.attached" = "Полезная нагрузка установлена";
"payload.message.released" = "Полезная нагрузка сброшена";
"payload.message.dropped_successfully" = "Сброс полезной нагрузки выполнен";
"payload.message.cleanup_completed" = "Сброшенная ПН удалена из сцены";
"payload.message.removed" = "Полезная нагрузка снята";
"payload.message.no_payload_attached" = "Полезная нагрузка не установлена";
"payload.message.select_uav" = "Сначала выберите БЛА";
"payload.message.payload_limit_exceeded" = "Масса ПН превышает лимит выбранного БЛА";
"payload.message.takeoff_limit_exceeded" = "Итоговая масса превышает максимальную взлетную массу";
"payload.message.data_unavailable" = "Для этого профиля БЛА нет достаточных данных по полезной нагрузке";
"payload.message.invalid_mass" = "Задайте массу ПН больше нуля";
"payload.type.cargo_box" = "Грузовой контейнер";
"payload.type.camera_gimbal" = "Камерный подвес";
"payload.type.thermal_camera" = "Тепловизионная камера";
"payload.type.lidar_module" = "Лидарный модуль";
"payload.type.rescue_pack" = "Спасательный комплект";
"payload.type.sensor_module" = "Сенсорный модуль";
"payload.type.radio_relay" = "Радиорелейный модуль";
"payload.type.custom" = "Пользовательская";
"payload.placeholder.message" = "Функция будет добавлена позже.";
"control_mode.angle" = "Угловой";
"command.arm" = "Армировать";
"command.disarm" = "Разармировать";
"telemetry.arm_state" = "Состояние армирования";
"arm_state.armed" = "Армирован";
"arm_state.disarmed" = "Разармлен";
"flight_state.disarmed" = "Разармлен";
"flight_state.armed_idle" = "Армирован, ожидание";
"flight_state.crashed" = "Крушение";
"warning.disarmed" = "Аппарат разармлен";
"warning.integrity_critical" = "Критическое повреждение конструкции";
"warning.crashed" = "Аппарат потерпел крушение";
"damage.severity.nominal" = "Норма";
"damage.severity.light" = "Легкие";
"damage.severity.medium" = "Средние";
"damage.severity.critical" = "Критические";
"keybind.camera.mode2" = "Камера 2 (Вид от хвоста)";
"keybind.camera.mode3" = "Камера 3 (Орбита)";
"keybind.camera.mode4" = "Камера 4 (FPV)";
"keybind.camera.mode5" = "Камера 5 (Вид сверху)";
"keybind.camera.mode6" = "Камера 6 (Падение ПН)";
"keybind.camera.toggle_fpv" = "Переключить FPV";
"keybind.camera.cycle_mode" = "Смена режима камеры";
"keybind.camera.zoom_in" = "Приблизить";
"keybind.camera.zoom_out" = "Отдалить";
"keybind.camera.yaw_left" = "Камера: влево";
"keybind.camera.yaw_right" = "Камера: вправо";
"keybind.camera.pitch_up" = "Камера: вверх";
"keybind.camera.pitch_down" = "Камера: вниз";
"keybind.camera.reset_orientation" = "Сброс ориентации камеры";
"workspace.toolstrip" = "Лента инструментов";
"toolstrip.tab.simulation" = "Симуляция";
"toolstrip.tab.flight" = "Полет";
"toolstrip.tab.camera" = "Камера";
"toolstrip.tab.environment" = "Окружение";
"toolstrip.tab.debug" = "Отладка";
"toolstrip.tab.projects" = "Проекты";
"toolstrip.section.run" = "Управление запуском";
"toolstrip.section.flight_model" = "Аппарат и режим";
"toolstrip.section.throttle" = "Тяга";
"toolstrip.section.camera_modes" = "Режимы камеры";
"toolstrip.section.camera_quick" = "Пресеты камеры";
"toolstrip.section.weather" = "Погода";
"toolstrip.section.terrain" = "Местность";
"toolstrip.section.debug" = "Диагностика";
"toolstrip.section.projects" = "Действия проекта";
"camera.zoom_in" = "Приблизить";
"camera.zoom_out" = "Отдалить";
"camera.reset_orientation" = "Сбросить вид";
"panel.collision_debug" = "Отладка коллизий";
"window.fullscreen" = "Полный экран";
"keybind.ui.toggle_panel" = "Свернуть / развернуть панель";
"keybind.ui.toggle_hud" = "Переключить HUD телеметрии";
"keybind.flight.release_payload" = "Сбросить полезную нагрузку";
"keybind.debug.toggle_damage" = "Переключить оверлей повреждений";
"keybind.debug.toggle_thermal" = "Переключить тепловой оверлей";
"keybind.capture.idle" = "Выберите действие и нажмите переназначение.";
"keybind.capture.prompt" = "Нажмите клавишу для \"%@\" (Esc для отмены)";
"keybind.rebind" = "Переназначить";
"keybind.capturing" = "Ожидание…";
"keybind.reset_defaults" = "Сброс по умолчанию";
"keybind.key.space" = "Пробел";
"keybind.key.code" = "Клавиша %d";

"control_mode.title" = "Режим управления полетом";
"control_mode.stabilized" = "Стабилизированный";
"control_mode.acro" = "Акро";
"control_mode.hover_assist" = "Удержание высоты";

"common.export" = "Экспорт";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематографичный";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Близкое следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сбросить к пресету";
"camera.advanced" = "Расширенные настройки камеры";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Среда";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"diagnostic.last_collision_source" = "Источник последней коллизии";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Физические тела";
"diagnostic.active_particles" = "Частицы";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Кадр";
"telemetry.physics_time" = "Физика";
"telemetry.render_time" = "Рендер";
"telemetry.path_time" = "Планировщик";
"telemetry.active_objects" = "Объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА дельта-крыло";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"menu.title" = "Проекты БПЛА";
"menu.saved_projects" = "Сохраненные проекты";
"menu.create_project" = "Создать проект";
"menu.recent_project" = "Последний проект";
"menu.search" = "Поиск проекта";
"menu.sort" = "Сортировка";

"project.name" = "Имя проекта";
"project.sort.newest" = "Сначала новые";
"project.sort.name" = "По имени";
"project.sort.recent" = "Недавно открытые";
"project.create.title" = "Создание проекта";
"project.create.action" = "Создать";
"project.open.action" = "Открыть список проектов";
"project.open.failure" = "Не удалось открыть проект";
"project.save.action" = "Сохранить проект";
"project.save_as.action" = "Сохранить как";
"project.save_as.title" = "Сохранить проект как";
"project.save.success" = "Проект сохранен";
"project.save.failure" = "Ошибка сохранения проекта";
"project.duplicate.title" = "Дублировать проект";
"project.duplicate.action" = "Дублировать проект";
"project.duplicate.success" = "Проект продублирован";
"project.duplicate.failure" = "Ошибка дублирования проекта";
"project.delete.action" = "Удалить проект";
"project.delete.failure" = "Не удалось удалить проект";
"project.delete.confirm.title" = "Удаление проекта";
"project.delete.confirm.message" = "Удалить проект '%@'?";

"project.unsaved.title" = "Несохраненные изменения";
"project.unsaved.message" = "Сохранить проект '%@'?\nНесохраненные изменения могут быть потеряны.";
"project.unsaved.save" = "Сохранить";
"project.unsaved.save_exit" = "Сохранить и выйти";
"project.unsaved.exit_without" = "Выйти без сохранения";

"telemetry.export.select_folder" = "Выберите папку для экспорта файла телеметрии.";
"control_mode.acro" = "Акро / скоростной";
"control_mode.hover_assist" = "Зависание / удержание высоты";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Окружение";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематограф";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Плотное следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сброс к пресету";
"camera.advanced" = "Расширенная камера";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";

"diagnostic.last_collision_source" = "Источник последнего столкновения";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Активные физические тела";
"diagnostic.active_particles" = "Количество частиц";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Время кадра";
"telemetry.physics_time" = "Время физики";
"telemetry.render_time" = "Время рендера";
"telemetry.path_time" = "Время поиска пути";
"telemetry.active_objects" = "Активные объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА с дельта-крылом";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.model.ebee_class" = "Картографический БПЛА класса eBee";
"drone.model.ux11_class" = "Съёмочный БПЛА класса UX11";
"drone.model.wingtra_class" = "VTOL БПЛА класса Wingtra";
"drone.model.trinity_class" = "Профессиональный БПЛА класса Trinity";

"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.visual.ebee_class" = "Бесхвостая летающая платформа для картографии";
"drone.visual.ux11_class" = "Классический самолётный БПЛА для аэросъёмки";
"drone.visual.wingtra_class" = "VTOL fixed-wing типа tailsitter";
"drone.visual.trinity_class" = "Профессиональная survey eVTOL-платформа";

"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"common.not_specified" = "Не указано";

"country.china" = "Китай";
"country.united_states" = "США";
"country.norway" = "Норвегия";
"country.switzerland" = "Швейцария";
"country.germany" = "Германия";
"country.israel" = "Израиль";
"country.poland" = "Польша";
"country.canada" = "Канада";
"country.user_defined" = "Задано пользователем";

"uav.filter.type" = "Тип";
"uav.filter.mass" = "Масса";
"uav.filter.vehicle.all" = "Все";
"uav.filter.vehicle.multicopters" = "Мультикоптеры";
"uav.filter.vehicle.helicopters" = "Вертолетные";
"uav.filter.vehicle.fixed_wing" = "Самолетные";
"uav.filter.vehicle.hybrid_vtol" = "Гибриды VTOL";
"uav.filter.mass.all" = "Все";
"uav.filter.mass.nano" = "Нано";
"uav.filter.mass.micro" = "Микро";
"uav.filter.mass.light" = "Легкие";
"uav.filter.mass.medium" = "Средние";
"uav.filter.mass.heavy" = "Тяжелые";

"uav.vehicle.multicopter" = "Мультикоптер";
"uav.vehicle.fixed_wing" = "Самолетный";
"uav.vehicle.hybrid_vtol" = "Гибрид VTOL";
"uav.vehicle.helicopter" = "Вертолетный";
"uav.vehicle.custom" = "Пользовательский";

"uav.mass.nano" = "Нано";
"uav.mass.micro" = "Микро";
"uav.mass.light" = "Легкий";
"uav.mass.medium" = "Средний";
"uav.mass.heavy" = "Тяжелый";
"uav.mass.custom" = "Пользовательский";

"uav.spec.verified" = "Проверен";
"uav.spec.partial" = "Частичный";
"uav.spec.custom" = "Пользовательский";

"uav.badge.custom" = "КАСТОМ";
"uav.catalog.title" = "Каталог БЛА";
"uav.catalog.empty" = "Нет профилей БЛА, соответствующих текущим фильтрам.";
"uav.catalog.edit_abstract" = "Редактировать абстрактный БЛА";
"uav.catalog.selected_outside_filter" = "Выбранная модель не входит в текущий фильтр";

"uav.card.title" = "Выбранный БЛА";
"uav.card.manufacturer" = "Производитель";
"uav.card.country" = "Страна";
"uav.card.type" = "Тип";
"uav.card.mass_class" = "Массовый класс";
"uav.card.base_mass" = "Масса БЛА";
"uav.card.max_payload" = "Макс. полезная нагрузка";
"uav.card.mtow" = "Макс. взлетная масса";
"uav.card.role" = "Роль";
"uav.card.status" = "Статус";
"uav.card.payload_data_source" = "Данные ПН";
"uav.card.armament_note" = "Примечание по вооружению";
"uav.card.empty" = "Профиль БЛА не выбран";

"uav.manufacturer.custom" = "Пользовательский";

"uav.profile.abstract-uav.display_name" = "Абстрактный БЛА";
"uav.profile.dji-matrice-350-rtk.short_description" = "Промышленный квадрокоптер с шасси, центральным отсеком подвеса и поддержкой модульной полезной нагрузки.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Инспекция, картография и задачи общественной безопасности";
"uav.profile.dji-flycart-30.short_description" = "Тяжелый грузовой мультикоптер с коаксиальными подъемными группами и центральным нижним грузовым отсеком.";
"uav.profile.dji-flycart-30.mission_role" = "Грузовая доставка и логистика";
"uav.profile.dji-mavic-4-pro.short_description" = "Складной потребительский мультикоптер с трехкамерным передним подвесом.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Потребительская аэросъемка и съемка для создателей контента";
"uav.profile.dji-neo.short_description" = "Сверхкомпактный мультикоптер с защитой пропеллеров для роли легкой персональной летающей камеры.";
"uav.profile.dji-neo.mission_role" = "Персональная аэросъемка";
"uav.profile.dji-phantom-3-standard.short_description" = "Классический квадрокоптер Phantom со встроенным шасси и передним отсеком подвеса камеры.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Потребительская аэросъемка";
"uav.profile.freefly-alta-x.short_description" = "Тяжелый мультикоптер с открытой рамой для кино- и индустриальных задач и центральной нижней секцией полезной нагрузки.";
"uav.profile.freefly-alta-x.mission_role" = "Тяжелая кино- и индустриальная перевозка полезной нагрузки";
"uav.profile.griff-30.short_description" = "Тяжелый грузовой БЛА с крупной транспортной рамой и нижней зоной подвеса груза.";
"uav.profile.griff-30.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.griff-60.short_description" = "Крупный тяжелый грузовой БЛА с более грузоподъемной рамой, чем у Griff 30.";
"uav.profile.griff-60.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.avidrone-490tl.short_description" = "Грузовой БЛА вертолетного типа с тандемными роторами, вытянутым фюзеляжем и нижней грузовой позицией.";
"uav.profile.avidrone-490tl.mission_role" = "Грузовая перевозка и утилитарный подъем";
"uav.profile.wingtraone-gen-ii.short_description" = "Гибридный картографический VTOL-самолет с нижним отсеком съемочного оборудования и крейсерской самолетной схемой.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Картографическая съемка и фотограмметрия";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Дальнопролетный eVTOL-самолет для съемки с центральным сенсорным отсеком под фюзеляжем.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Картография и инспекция линейных объектов";
"uav.profile.mq-9b-skyguardian.short_description" = "Крупная платформа MALE самолетного типа с длинным крылом, носовой сенсорной архитектурой и многоточечной полезной нагрузкой.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Длительное ISR-наблюдение и многоцелевая патрульная работа";
"uav.profile.hermes-900.short_description" = "Многоцелевая платформа MALE с длинным крылом, толкающей схемой и сенсорными станциями под носом и фюзеляжем.";
"uav.profile.hermes-900.mission_role" = "Многоцелевая ISR-разведка и морское патрулирование";
"uav.profile.ft5-los.short_description" = "Двухдвигательная тактическая самолетная платформа с компактным разведывательным планером и модульной интеграцией полезной нагрузки.";
"uav.profile.ft5-los.mission_role" = "Тактическая разведка и ISTAR";
"uav.profile.flyeye.short_description" = "Легкий самолетный разведывательный БЛА с компактным фюзеляжем и нижней электрооптической полезной нагрузкой.";
"uav.profile.flyeye.mission_role" = "Ближняя разведка и наблюдение";
"uav.profile.abstract-uav.short_description" = "Пользовательский профиль БЛА для будущей настройки параметров.";
"uav.profile.abstract-uav.mission_role" = "Пользовательская задача";

"telemetry.path_status" = "Статус маршрута";
"telemetry.path_status.idle" = "Ожидание";
"telemetry.path_status.valid" = "Готов";
"telemetry.path_status.recomputing" = "Перестроение";
"telemetry.path_status.blocked" = "Заблокирован";
"telemetry.auto_nav" = "Автонавигация";
"telemetry.auto_nav.active" = "ВКЛ";
"telemetry.auto_nav.inactive" = "ВЫКЛ";
"telemetry.control_authority" = "Источник управления";
"telemetry.input_flags" = "Флаги ввода";
"telemetry.state_flags" = "Флаги состояния";
"common.on" = "ВКЛ";
"common.off" = "ВЫКЛ";
"telemetry.target_distance" = "Дист. до цели";
"telemetry.target_bearing" = "Пеленг на цель";
"telemetry.waypoint" = "Маршрутная точка";
"telemetry.waypoint.value" = "индекс %d, осталось %d";
"telemetry.path_remaining" = "Остаток маршрута";

"panel.modules.on" = "Модули: Вкл";
"panel.modules.off" = "Модули: Выкл";

"toolbar.cluster.status" = "Текущий статус";
"toolbar.cluster.status.subtitle" = "Текущий контур управления и активный модуль";
"toolbar.cluster.project" = "Действия проекта";
"toolbar.cluster.project.subtitle" = "Сохранение сессии и управление окном";
"toolbar.cluster.utility" = "Инструменты оператора";
"toolbar.cluster.utility.subtitle" = "Горячие клавиши, HUD и язык";

"sidebar.metric.mode" = "Режим";
"sidebar.metric.state" = "Состояние";
"sidebar.metric.camera" = "Камера";
"sidebar.metric.platform" = "Платформа";
"sidebar.metric.battery" = "Батарея";
"sidebar.metric.warnings" = "Предупреждения";
"sidebar.metric.throttle" = "Тяга";
"sidebar.metric.preset" = "Пресет";
"sidebar.metric.fov" = "Угол обзора";
"sidebar.metric.distance" = "Дистанция";
"sidebar.metric.weather" = "Погода";
"sidebar.metric.terrain" = "Рельеф";
"sidebar.metric.wind" = "Ветер";
"sidebar.metric.boundary" = "Контур";
"sidebar.metric.manufacturer" = "Производитель";
"sidebar.value.on" = "Вкл";
"sidebar.value.off" = "Выкл";

"toolbar.header.project" = "Действия проекта";

"module.panel.idle" = "МОДУЛИ";
"module.panel.idle.subtitle" = "Выберите инструмент на панели, чтобы открыть рабочий модуль";

"module.flight_ops.title" = "ПОЛЕТНЫЕ ОПЕРАЦИИ";
"module.flight_ops.toolbar_title" = "Полет";
"module.flight_ops.subtitle" = "Запуск, возврат и управление тягой";
"module.flight_ops.command_stack" = "Блок команд";
"module.flight_ops.command_stack.subtitle" = "Основные действия аппарата и автоматические режимы";
"module.flight_ops.control_law" = "Режим управления";
"module.flight_ops.control_law.subtitle" = "Переключение законов управления без выхода из сцены";
"module.flight_ops.active_mode" = "АКТИВЕН";
"module.flight_ops.thrust" = "Канал тяги";
"module.flight_ops.thrust.subtitle" = "Прямая тяга и фиксированные уставки";
"module.flight_ops.override" = "Безопасность / Сброс";
"module.flight_ops.override.subtitle" = "Питание симуляции, восстановление и аварийный стоп";

"module.uav_catalog.title" = "КАТАЛОГ БЛА";
"module.uav_catalog.toolbar_title" = "БЛА";
"module.uav_catalog.subtitle" = "Выбор платформы и активного профиля";
"module.uav_catalog.selection" = "Сводка платформ";
"module.uav_catalog.selection.subtitle" = "Состояние фильтра и текущего выбора";
"module.uav_catalog.metric.active" = "Активный профиль";
"module.uav_catalog.metric.filtered" = "После фильтра";
"module.uav_catalog.metric.type" = "Тип аппарата";
"module.uav_catalog.metric.mass" = "Массовый класс";
"module.uav_catalog.list.subtitle" = "Фильтры каталога, список платформ и карточка профиля";

"module.payload.title" = "ПОЛЕЗНАЯ НАГРУЗКА";
"module.payload.toolbar_title" = "ПН";

"module.camera.title" = "КАМЕРА";
"module.camera.toolbar_title" = "Камера";
"module.camera.subtitle" = "Ракурс, оптика и FPV-настройка";
"module.camera.mode_stack" = "Режимы камеры";
"module.camera.mode_stack.subtitle" = "Рабочие режимы наблюдения за сценой";
"module.camera.active_mode" = "В РАБОТЕ";
"module.camera.presets" = "Набор пресетов";
"module.camera.presets.subtitle" = "Миссионные пресеты и быстрый сброс вида";
"module.camera.optics" = "Оптика";
"module.camera.optics.subtitle" = "Дистанция камеры и угол обзора";
"module.camera.advanced.subtitle" = "Раскрывать только при необходимости глубокой настройки";
"module.camera.show_advanced" = "Показать расширенную настройку камеры";
"module.camera.hide_advanced" = "Скрыть расширенную настройку камеры";
"module.camera.fpv_stack" = "Параметры FPV";
"module.camera.preset_hint.cinematic" = "Широкий и плавный ракурс для презентационного полета";
"module.camera.preset_hint.pilot" = "Сбалансированный операторский вид для общего пилотажа";
"module.camera.preset_hint.inspection" = "Более близкое кадрирование для осмотра объектов";
"module.camera.preset_hint.wide_follow" = "Увеличенная дистанция следования для обстановки";
"module.camera.preset_hint.tight_follow" = "Плотное следование для точной работы";
"module.camera.preset_hint.fpv" = "Кокпитный вид с прямой осью наблюдения";

"module.scenario.title" = "СЦЕНАРИЙ";
"module.scenario.toolbar_title" = "Сценарий";
"module.scenario.subtitle" = "Погода, местность и габариты рабочей зоны";
"module.scenario.weather" = "Погодный профиль";
"module.scenario.weather.subtitle" = "Пресеты и интенсивность внешних условий";
"module.scenario.show_weather_tuning" = "Показать параметры ветра";
"module.scenario.hide_weather_tuning" = "Скрыть параметры ветра";
"module.scenario.active_preset" = "АКТИВЕН";
"module.scenario.terrain" = "Профиль местности";
"module.scenario.terrain.subtitle" = "Масштаб карты, плотность и граничный контур";
"module.scenario.active_profile" = "АКТИВЕН";

"module.diagnostics.title" = "ДИАГНОСТИКА";
"module.diagnostics.toolbar_title" = "Диагностика";
"module.diagnostics.subtitle" = "Телеметрия, системные состояния и техническое состояние";
"module.diagnostics.overlay" = "Режимы наложения";
"module.diagnostics.overlay.subtitle" = "Служебные слои и диагностическая видимость";
"module.diagnostics.runtime_summary" = "Системная сводка";
"module.diagnostics.runtime_summary.subtitle" = "Счетчики кадра, физики, рендера и объектной нагрузки";
"module.diagnostics.telemetry" = "Блок телеметрии";
"module.diagnostics.telemetry.subtitle" = "Расширенный вывод миссии, питания и производительности";
"module.diagnostics.warning_bus" = "Лента предупреждений";
"module.diagnostics.warning_bus.subtitle" = "Текущие тревоги от полета, батареи и среды";
"module.diagnostics.fleet" = "Координация группы";
"module.diagnostics.fleet.subtitle" = "Поведение ведомых и дистанция строя";
"module.diagnostics.damage" = "Повреждения / Тепло";
"module.diagnostics.damage.subtitle" = "Видимость компонентов и контроль целостности";
"module.diagnostics.station" = "Станционные настройки";
"module.diagnostics.station.subtitle" = "Язык оператора и локальные параметры рабочего места";
"module.diagnostics.panel.overview" = "Обзор";
"module.diagnostics.panel.mission" = "Миссия";
"module.diagnostics.panel.telemetry" = "Телеметрия";
"module.diagnostics.panel.fleet" = "Группа";
"module.diagnostics.panel.service" = "Сервис";
"module.diagnostics.mission.latest_critical" = "Последний critical";
"module.diagnostics.mission.latest_warning" = "Последний warning";
"module.mission.metric.distance_remaining" = "Остаток";
"module.mission.metric.eta_remaining" = "ETA";
"module.mission.metric.outcome" = "Исход";
"module.mission.timeline.events" = "События";
"module.mission.timeline.warnings" = "Warnings";
"module.mission.timeline.critical" = "Critical";
"module.mission.debrief.verdict" = "Вердикт";
"module.mission.debrief.key_warnings" = "Ключевые предупреждения";
"module.mission.debrief.critical_log" = "Сводка инцидентов";

"project.default_name" = "Проект %@";
"project.copy_suffix" = "копия";
"project.clone_suffix" = "дубликат";

"control_authority.none" = "НЕТ";
"control_authority.manual" = "РУЧНОЕ";
"control_authority.marker" = "МЕТКА";
"control_authority.failsafe" = "АВАРИЙНЫЙ";
"control_authority.blocked" = "БЛОК";

"payload_camera.state.inactive" = "ВЫКЛ";
"payload_camera.state.falling" = "ПАДЕНИЕ";
"payload_camera.state.impact" = "УДАР";
"payload_camera.state.rest" = "ПОКОЙ";

"overlay.payload_view.title" = "КАМЕРА ПН";
"overlay.payload_view.metric.alt" = "ВЫС";
"overlay.payload_view.metric.vertical_speed" = "V/S";
"overlay.payload_view.metric.time" = "ВРЕМ";
"overlay.payload_view.metric.state" = "СТАТ";

"overlay.terrain_map.title" = "КАРТА МЕСТНОСТИ";
"overlay.terrain_map.subtitle" = "Обзор препятствий и одиночная целевая метка";
"overlay.terrain_map.clear" = "СБР";
"overlay.terrain_map.target_metrics.empty" = "ДИСТ —   ПЕЛ —";
"overlay.terrain_map.target_metrics.format" = "ДИСТ %.1f м   ПЕЛ %03.0f°";
"overlay.terrain_map.heading_alt_objects.format" = "КУР %@°   ВЫС %.1f м   ОБЪ %d";
"overlay.terrain_map.position_map.format" = "X %+.1f   Z %+.1f   КАРТА %@";
"overlay.terrain_map.status.format" = "СИГ %@   АВТОНАВ %@";

"overlay.compass.title" = "КОМПАС";
"overlay.compass.subtitle" = "Курс / север / пеленг цели";
"overlay.compass.metric.heading" = "КУР";
"overlay.compass.metric.north" = "С";
"overlay.compass.metric.bearing" = "ПЕЛ";
"overlay.compass.marker.current" = "КУР";
"overlay.compass.marker.target" = "ЦЕЛ";

"hud.compact.position" = "ПОЗ  x %.1f  y %.1f  z %.1f";
"hud.compact.speed_battery" = "СКР  %.1f м/с   АКБ %.0f%%";
"hud.compact.auto_nav" = "АВТО %@  ДИСТ %@  ПЕЛ %@";

"telemetry.flags.input.format" = "РУЧ %@ | МЕТ %@ | ПН %@ | КАРТ %@";
"telemetry.flags.state.format" = "РАЗ %@ | БЛК %@ | СИГ %@";
"telemetry.flags.mission.format" = "КАРТ %@ | ЗС %@ | ГОТ %@ | В %@ | СБР %@";
